OPENFOAM/rectangularWing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-5  -6  -5)
    (10  -6  -5)
    (10   6  -5)
    (-5   6  -5)
    (-5  -6   5)
    (10  -6   5)
    (10   6   5)
    (-5   6   5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 60 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }

    topBottom
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);

mergePatchPairs
(
);